In [1]:
#Data.csv

**Step 1: Importing the libraries**

In [2]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler

**Step 2: Importing dataset**

In [3]:
df=pd.read_csv('Data.csv')

In [4]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

**Step 3: Handling the missing data**

In [5]:
df.shape

(10, 4)

In [6]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [7]:
df["Age"].fillna(np.mean(df["Age"]), inplace = True)
df["Salary"].fillna(np.mean(df["Salary"]), inplace = True)

In [8]:
df.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [9]:
df # still we can change as int ... just leave as flot to prefer month also

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

**Step 4: Encoding categorical data**

In [10]:
df['Country'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [11]:
df['Purchased']=df['Purchased'].replace(['Yes','No'],[1,0])

In [12]:
df.head(2)

  Country   Age   Salary  Purchased
0  France  44.0  72000.0          0
1   Spain  27.0  48000.0          1

**Step 5: Creating a dummy variable**

In [13]:
a=pd.get_dummies(df['Country'])

In [14]:
df = pd.concat([a, df.drop("Country",axis=1)],axis=1)

In [15]:
df.head(2)

   France  Germany  Spain   Age   Salary  Purchased
0       1        0      0  44.0  72000.0          0
1       0        0      1  27.0  48000.0          1

**Step 6: Splitting the datasets into training sets and Test sets**

In [16]:
x=df.iloc[:,[0,1,2,3,4]]
y=df.iloc[:,5]

In [17]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.3)

In [18]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.3)

**Step 7: Feature Scaling**

In [19]:
scaler = StandardScaler()
x_train = scaler.fit_transform(x_train)
x_test = scaler.transform(x_test)

In [21]:
x_train[0:5]

array([[-1.15470054,  1.58113883, -0.40824829, -1.0618737 , -0.97898054],
       [ 0.8660254 , -0.63245553, -0.40824829, -0.45260191, -0.64872204],
       [ 0.8660254 , -0.63245553, -0.40824829,  0.64408733,  0.50718269],
       [-1.15470054, -0.63245553,  2.44948974, -1.42743678, -1.47436828],
       [ 0.8660254 , -0.63245553, -0.40824829, -0.20889319,  0.09435957]])

In [22]:
x_test[0:5]

array([[-1.15470054,  1.58113883, -0.40824829,  0.15666989, -0.171682  ],
       [-1.15470054, -0.63245553,  2.44948974, -0.08703883, -0.40102817],
       [-1.15470054, -0.63245553,  2.44948974,  0.00773678, -1.14410979]])